app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = 2
---

<h3>Comments(<%= @article.comments.size %>)</h3>