app/controllers/articles_controller.rb

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", nil], ["created_at", Mon, 17 Dec 2012 11:24:17 UTC +00:00], ["title", "abcd"], ["updated_at", Mon, 17 Dec 2012 11:24:17 UTC +00:00]]
---
	def create
		@article = Article.new(params[:article])
		@article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "articles" SET "image_file_name" = 'baba.contact', "image_content_type" = 'text/x-ms-contact', "image_file_size" = 44595, "updated_at" = '2012-12-19 08:37:12.054444' WHERE "articles"."id" = 1
---
	def update
		@article = Article.find(params[:id])
		@article.update_attributes(params[:article])