app/controllers/authors_controller.rb

INSERT INTO "authors" ("created_at", "crypted_password", "email", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "authors" SET "salt" = '2ejUhfp8yqKjHYQWsKVS', "crypted_password" = '$2a$10$wufKH9F32rlRXFXD8NxeyOTV4LDE3aVMvxXPDKNh9w6HSfTsptCka', "updated_at" = '2012-12-19 10:02:37.691614' WHERE "authors"."id" = 3
---
  def update
    @author = Author.find(params[:id])

    respond_to do |format|
      if @author.update_attributes(params[:author])