app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", nil], ["author_name", "asdasd"], ["body", "asdcas"], ["created_at", Tue, 18 Dec 2012 11:33:23 UTC +00:00], ["updated_at", Tue, 18 Dec 2012 11:33:23 UTC +00:00]]
---
	def create
		article_id = params[:comment].delete(:article_id)

		@comment = Comment.new(params[:comment])
		@comment.article_id = article_id

		@comment.save